Repository: gnachman/iTerm2
Catalog: sources/API/mul.lproj/iTermScriptTemplatePickerWindowController.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# 0PH-7V-7pR.title
source: A simple script that doesn't have any dependencies besides the iterm2 library.
de: Ein einfaches Skript, das außer der iterm2-Bibliothek keine weiteren Abhängigkeiten hat.
ja: iterm2ライブラリ以外に依存関係のないシンプルなスクリプトです。
pt_br: Um script simples que não tem nenhuma dependência além da biblioteca iterm2.
ru: Простой скрипт, у которого нет других зависимостей, кроме библиотеки iterm2.
zh_hans: 一个除了 iterm2 库外不依赖任何其他内容的简单脚本。

# 4Ao-3N-cjn.title
source: Basic
de: Standard
ja: 基本
pt_br: Básico
ru: Базовый
zh_hans: 基本

# Bvi-lb-MnN.title
source: Long-Running Daemon
de: Lang laufender Daemon
ja: 長時間実行デーモン
pt_br: Daemon de longa duração
ru: Демон длительного выполнения
zh_hans: 长期运行的守护进程

# erL-4L-rkl.title
source: Simple
de: Einfach
ja: シンプル
pt_br: Simples
ru: Простой
zh_hans: 简单

# hm4-4H-MvX.title
source: Cancel
de: Abbrechen
ja: キャンセル
pt_br: Cancelar
ru: Отмена
zh_hans: 取消

# keb-oF-eRS.title
source: Choose this template for a simple script that performs actions and terminates.
de: Wählen Sie diese Vorlage für ein einfaches Skript, das Aktionen ausführt und sich dann beendet.
ja: アクションを実行して終了するシンプルなスクリプトには、このテンプレートを選択してください。
pt_br: Escolha este modelo para um script simples que executa ações e termina.
ru: Выберите этот шаблон для простого скрипта, который выполняет действия и завершает работу.
zh_hans: 选择此模板可创建执行操作后结束的简单脚本。

# mIg-Ye-rwA.title
source: A script that depends on PyPI packages other than the iterm2 library. A private pyenv will be created for this script.
de: Ein Skript, das von PyPI-Paketen abhängt, die über die iterm2-Bibliothek hinausgehen. Für dieses Skript wird eine private pyenv erstellt.
ja: iterm2ライブラリ以外のPyPIパッケージに依存するスクリプトです。このスクリプト専用のpyenvが作成されます。
pt_br: Um script que depende de pacotes do PyPI além da biblioteca iterm2. Um pyenv privado será criado para este script.
ru: Скрипт, который зависит от пакетов PyPI, помимо библиотеки iterm2. Для этого скрипта будет создано отдельное окружение pyenv.
zh_hans: 一个依赖 iterm2 库之外的其他 PyPI 软件包的脚本。将为此脚本创建专用的 pyenv。

# Qv1-jV-kL5.title
source: Choose a script template:
de: Wählen Sie eine Skriptvorlage:
ja: スクリプトテンプレートを選択:
pt_br: Escolha um modelo de script:
ru: Выберите шаблон скрипта:
zh_hans: 选择脚本模板：

# vJf-M0-oyN.title
source: Full Environment
de: Vollständige Umgebung
ja: フル環境
pt_br: Ambiente completo
ru: Полное окружение
zh_hans: 完整环境

# vRx-t4-Url.title
source: Choose this template for a script that stays running and responds to notifications.
de: Wählen Sie diese Vorlage für ein Skript, das dauerhaft läuft und auf Benachrichtigungen reagiert.
ja: 実行し続けて通知に応答するスクリプトには、このテンプレートを選択してください。
pt_br: Escolha este modelo para um script que permanece em execução e responde a notificações.
ru: Выберите этот шаблон для скрипта, который остаётся запущенным и реагирует на уведомления.
zh_hans: 选择此模板可创建持续运行并响应通知的脚本。

# zMT-9q-c4b.title
source: Choose a Python environment:
de: Wählen Sie eine Python-Umgebung:
ja: Python環境を選択:
pt_br: Escolha um ambiente Python:
ru: Выберите окружение Python:
zh_hans: 选择 Python 环境：
